Revit 2024 API
Stone.StoneColor Property
 The property labeled "Image" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string StoneColor { get; }
Visual Basic
Public Shared ReadOnly Property StoneColor As String
	Get
Visual C++
public:
static property String^ StoneColor {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Stone Class
Autodesk.Revit.DB.Visual Namespace